eisup_2019_docmng_integration/src/Catalogs/абс_ПравилаЗакрытияСчетов/абс_ПравилаЗакрытияСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_ПравилаЗакрытияСчетов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Счет</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
      <types>ChartOfAccountsRef.Международный</types>
      <types>ChartOfAccountsRef.Налоговый</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаБаза</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МодульПолученияТаблицыДвижений</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьТаблицуПоМодулю</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИспользуетсяДЗО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПроектныйУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Архив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыЗапроса</name>
    <attributes>
      <name>НазваниеПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыЗапросаБаза</name>
    <attributes>
      <name>НазваниеПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>абс_ИсторияИзменения</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Владелец</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Разработчик</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтарыйТекстЗапроса</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтарыйТекстЗапросаБаза</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтраныйМодульПолученияТаблицыДвижений</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Catalogs/абс_ПравилаЗакрытияСчетов/ManagerModule.bsl
//СТАНДАРТНЫЕ ПРОЦЕДУРЫ ЗАКРЫТИЯ
Процедура ЗакрытиеСчета26(СтруктураДвижений,Счет,Организация,Период,ТаблицаРезультатаЗапроса,ТаблицаРезультатаЗапросаБаза)
Для каждого СтрокаРезЗапроса из ТаблицаРезультатаЗапроса.Строки Цикл
	Сумма = СтрокаРезЗапроса.Сумма;
	МассивСумм = ttk_ОбщегоНазначения.РаспределитьПропорционально(Сумма,ТаблицаРезультатаЗапросаБаза.Строки.ВыгрузитьКолонку("СуммаОборотКт"));
	сч = 0;
	Если МассивСумм = Неопределено Тогда
		
	иначе
	
	Для каждого РаспределеннаяСумма из МассивСумм Цикл
		Движение = СтруктураДвижений.Хозрасчетный.Добавить();
		Движение.Период = СтруктураДвижений.Период;
		Движение.Организация = СтруктураДвижений.Организация;
		Движение.СчетКт = Счет;
		Движение.Счетдт = ПланыСчетов.Хозрасчетный.НайтиПоКоду("90.08");
		Движение.ВидСубконтоДт1 = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы;
		Движение.СубконтоДт1 = ТаблицаРезультатаЗапросаБаза.Строки[Сч].Субконто1;
		Движение.Сумма = РаспределеннаяСумма;		
		Сч = Сч+1;
	КонецЦикла;
	конецЕсли;
КонецЦикла;

	
КонецПроцедуры


//\\СТАНДАРНЫЕ


Функция ПостроитьТаблицуРезультатаЗапроса(ТекстЗ,ПараметрыЗ,Счет,СтруктураДвижений) Экспорт
	Запрос = Новый Запрос (ТекстЗ);
	Для каждого строкаПараметры из ПараметрыЗ Цикл
		Запрос.УстановитьПараметр(СтрокаПараметры.НазваниеПараметра,СтрокаПараметры.Параметр);
	КонецЦикла;
	Запрос.УстановитьПараметр("Счет",Счет);
	Запрос.УстановитьПараметр("Организация",СтруктураДвижений.Организация);
	Запрос.УстановитьПараметр("Период",СтруктураДвижений.Период);
	
	//++ Добавлена возможность передавать переменные параметры из документа
	Если СтруктураДвижений.Свойство("ПараметрыДокументаДляЗапроса") Тогда
		Для каждого строкаПараметры из СтруктураДвижений.ПараметрыДокументаДляЗапроса Цикл
			Запрос.УстановитьПараметр(СтрокаПараметры.НазваниеПараметра, СтрокаПараметры.Параметр);
		КонецЦикла;	
	КонецЕсли;
	//--
	
	возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
КонецФункции


Процедура СформироватьПроводки(Правило, СтруктураДвижений) Экспорт
	ТаблицаРезультатаЗапроса = ПостроитьТаблицуРезультатаЗапроса(Правило.ТекстЗапроса,Правило.ПараметрыЗапроса,Правило.Счет,СтруктураДвижений);
	ТаблицаРезультатаЗапросаБаза = ПостроитьТаблицуРезультатаЗапроса(Правило.ТекстЗапросаБаза,Правило.ПараметрыЗапросаБаза,Правило.Счет,СтруктураДвижений);
	Счет = Правило.Счет;
	Организация = СтруктураДвижений.Организация;
	Период =  СтруктураДвижений.Период;
	Выполнить(Правило.МодульПолученияТаблицыДвижений);
	
КонецПроцедуры
